#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/arconsis-benchmarks/server-benchmarks/runs/run-Mm6AcpEKF189Q61v

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
module.books-database-quarkus.module.aurora_postgresql_v2.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.books-database-springboot.aws_rds_cluster_parameter_group.this: Refreshing state... [id=booksdb-springboot-cluster-parameter-group]
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0f148e21e9804a865]
module.books-database-quarkus.aws_rds_cluster_parameter_group.this: Refreshing state... [id=booksdb-quarkus-cluster-parameter-group]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:143441946271:cluster/server-benchmarks]
aws_iam_role.vpc_flow_cloudwatch_logs_role: Refreshing state... [id=vpc-flow-cloudwatch-logs-role]
module.books-database-quarkus.module.aurora_postgresql_v2.data.aws_partition.current: Reading...
module.books-database-quarkus.module.aurora_postgresql_v2.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.books-database-springboot.module.aurora_postgresql_v2.data.aws_partition.current: Reading...
module.database_secrets.data.aws_secretsmanager_secret.database_username_secret: Reading...
module.books-database-quarkus.module.aurora_postgresql_v2.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.ecs_task_execution_role: Reading...
module.database_secrets.data.aws_secretsmanager_secret.database_password_secret: Reading...
module.books-database-springboot.module.aurora_postgresql_v2.data.aws_partition.current: Read complete after 0s [id=aws]
module.books-database-springboot.data.aws_rds_engine_version.postgresql: Reading...
data.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=320642683]
module.books-database-springboot.module.aurora_postgresql_v2.data.aws_iam_policy_document.monitoring_rds_assume_role: Reading...
module.books-database-springboot.module.aurora_postgresql_v2.data.aws_iam_policy_document.monitoring_rds_assume_role: Read complete after 0s [id=1813475199]
module.books-database-quarkus.aws_db_parameter_group.this: Refreshing state... [id=booksdb-quarkus-db-parameter-group]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
module.books-database-quarkus.data.aws_rds_engine_version.postgresql: Reading...
module.books-database-springboot.aws_db_parameter_group.this: Refreshing state... [id=booksdb-springboot-db-parameter-group]
module.books-database-springboot.data.aws_rds_engine_version.postgresql: Read complete after 1s [id=14.5]
module.books-database-quarkus.module.aurora_postgresql_v2.aws_iam_role.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20230222150944748400000002]
module.database_secrets.data.aws_secretsmanager_secret.database_password_secret: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:143441946271:secret:booksdb_password-jxLU1d]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecsTaskExecutionRole]
module.database_secrets.data.aws_secretsmanager_secret.database_username_secret: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:143441946271:secret:booksdb_username-LuQUUS]
module.books-database-springboot.module.aurora_postgresql_v2.aws_iam_role.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20230222150944748200000001]
module.books-database-quarkus.data.aws_rds_engine_version.postgresql: Read complete after 1s [id=14.5]
module.database_secrets.data.aws_secretsmanager_secret_version.database_password_secret: Reading...
module.database_secrets.data.aws_secretsmanager_secret_version.database_username_secret: Reading...
module.database_secrets.data.aws_secretsmanager_secret_version.database_password_secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:143441946271:secret:booksdb_password-jxLU1d|AWSCURRENT]
aws_iam_role_policy.vpc_flow_cloudwatch_logs_policy: Refreshing state... [id=vpc-flow-cloudwatch-logs-role:vpc-flow-cloudwatch-logs-policy]
module.database_secrets.data.aws_secretsmanager_secret_version.database_username_secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:143441946271:secret:booksdb_username-LuQUUS|AWSCURRENT]
aws_iam_role_policy_attachment.ecs_task_execution_role: Refreshing state... [id=ecsTaskExecutionRole-20230222150945372900000004]
module.books-database-springboot.module.aurora_postgresql_v2.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20230222150944748200000001-20230222150945441900000005]
module.database_secrets.aws_iam_role_policy.password_policy_secretsmanager: Refreshing state... [id=ecsTaskExecutionRole:password-policy-secretsmanager]
module.books-database-quarkus.module.aurora_postgresql_v2.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20230222150944748400000002-20230222150945370400000003]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0f3545aae60b8ecd0]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-0a5cc4b1ff60fd4a5]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05d1fee7b95d5882b]
module.ecs_tasks_sg.aws_security_group.this: Refreshing state... [id=sg-093e12a955bfba951]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0eaa145600848182f]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0454a8bd614bde0aa]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0d554e4b3b4ac9b81]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ffeaf8b07d0b8487]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-019cc80e0e884da40]
module.private_database_sg.aws_security_group.this: Refreshing state... [id=sg-0686e0540aff25654]
module.alb_sg.aws_security_group.this: Refreshing state... [id=sg-015cd01a50594aac7]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-0f3545aae60b8ecd01080289494]
module.ecs_tasks_sg.aws_security_group_rule.egress_cidr_rules["1"]: Refreshing state... [id=sgrule-1771692507]
module.private_database_sg.aws_security_group_rule.ingress_cidr_rules["1"]: Refreshing state... [id=sgrule-3532895781]
module.private_database_sg.aws_security_group_rule.egress_cidr_rules["1"]: Refreshing state... [id=sgrule-209201792]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0ec4bb21201f56ff0]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02e7d0ab7da54a618]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-00a0e6f171ac13fe1]
module.books-database-quarkus.module.aurora_postgresql_v2.aws_db_subnet_group.this[0]: Refreshing state... [id=booksdb-quarkus]
module.books-database-springboot.module.aurora_postgresql_v2.aws_db_subnet_group.this[0]: Refreshing state... [id=booksdb-springboot]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-095e215d9fcda1742]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0477dd5e2dee98ffc]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-01eb832603a80d3f0]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0419c752a1d016f4a]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f6da3e2e5424e78f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0235ce0cdcf73be40]
module.alb_sg.aws_security_group_rule.egress_cidr_rules["1"]: Refreshing state... [id=sgrule-1917521768]
module.alb_sg.aws_security_group_rule.ingress_cidr_rules["1"]: Refreshing state... [id=sgrule-151494795]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-025e9abc8f5cfa514]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0cb1f963cb95953e9]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-01d8c24082a5619b6]
module.ecs_tasks_sg.aws_security_group_rule.ingress_source_sg_rules["1"]: Refreshing state... [id=sgrule-811080169]
module.vpc.aws_nat_gateway.ngw[0]: Refreshing state... [id=nat-05dfecabfdcd44fe7]
module.public_alb.aws_alb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:143441946271:loadbalancer/app/main-ecs-lb/130ad4e7ef9ade49]
module.vpc.aws_nat_gateway.ngw[1]: Refreshing state... [id=nat-080b40ede25ef7244]
module.vpc.aws_nat_gateway.ngw[2]: Refreshing state... [id=nat-06c7fe5c8def04c2c]
module.books-database-quarkus.module.aurora_postgresql_v2.aws_rds_cluster.this[0]: Refreshing state... [id=booksdb-quarkus]
module.books-database-springboot.module.aurora_postgresql_v2.aws_rds_cluster.this[0]: Refreshing state... [id=booksdb-springboot]
module.vpc.aws_route.private[0]: Refreshing state... [id=r-rtb-02e7d0ab7da54a6181080289494]
module.vpc.aws_route.private[2]: Refreshing state... [id=r-rtb-0ec4bb21201f56ff01080289494]
module.vpc.aws_route.private[1]: Refreshing state... [id=r-rtb-00a0e6f171ac13fe11080289494]
module.ecs_springboot_app.data.template_file.this: Reading...
module.books-database-springboot.module.aurora_postgresql_v2.aws_rds_cluster_instance.this["one"]: Refreshing state... [id=booksdb-springboot-one]
module.ecs_springboot_app.aws_cloudwatch_log_group.this: Refreshing state... [id=ecs/bookstore-springboot]
module.ecs_springboot_app.data.template_file.this: Read complete after 0s [id=24f83055f160dcd04f73ce40c45b4aecd243510f05aa7ed397be8ac31db8064b]
module.ecs_springboot_app.aws_ecs_task_definition.this: Refreshing state... [id=bookstore-springboot-task]
module.books-database-quarkus.module.aurora_postgresql_v2.aws_rds_cluster_instance.this["one"]: Refreshing state... [id=booksdb-quarkus-one]
module.ecs_quarkus_app.data.template_file.this: Reading...
module.ecs_quarkus_app.aws_cloudwatch_log_group.this: Refreshing state... [id=ecs/bookstore-quarkus]
module.ecs_quarkus_app.data.template_file.this: Read complete after 0s [id=61ec57fd00ed8cb6216c7ebe00be0d217e5765b561b301e7f3e5d1e7068d265c]
module.ecs_quarkus_app.aws_ecs_task_definition.this: Refreshing state... [id=bookstore-quarkus-task]
module.public_alb.aws_alb_listener.http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:143441946271:listener/app/main-ecs-lb/130ad4e7ef9ade49/984ad64207d015ff]
module.ecs_springboot_app.aws_alb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:143441946271:targetgroup/springboot-tg/4828af9d6861227c]
module.ecs_quarkus_app.aws_alb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:143441946271:targetgroup/quarkus-tg/bf56f2b41f6c1e8e]
module.ecs_springboot_app.aws_alb_listener_rule.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:143441946271:listener-rule/app/main-ecs-lb/130ad4e7ef9ade49/984ad64207d015ff/8d3fec8f15ea2dc2]
module.ecs_springboot_app.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:eu-west-1:143441946271:service/server-benchmarks/bookstore-springboot]
module.ecs_quarkus_app.aws_alb_listener_rule.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:143441946271:listener-rule/app/main-ecs-lb/130ad4e7ef9ade49/984ad64207d015ff/b3a57e73e9bf6305]
module.ecs_quarkus_app.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:eu-west-1:143441946271:service/server-benchmarks/bookstore-quarkus]
module.ecs_springboot_app.aws_appautoscaling_target.this[0]: Refreshing state... [id=service/server-benchmarks/bookstore-springboot]
module.ecs_quarkus_app.aws_appautoscaling_target.this[0]: Refreshing state... [id=service/server-benchmarks/bookstore-quarkus]
module.ecs_springboot_app.aws_appautoscaling_policy.ecs_policy_cpu[0]: Refreshing state... [id=springboot_scaling-scale-cpu]
module.ecs_springboot_app.aws_appautoscaling_policy.ecs_policy_memory[0]: Refreshing state... [id=springboot_scaling-scale-memory]
module.ecs_quarkus_app.aws_appautoscaling_policy.ecs_policy_memory[0]: Refreshing state... [id=quarkus_scaling-scale-memory]
module.ecs_quarkus_app.aws_appautoscaling_policy.ecs_policy_cpu[0]: Refreshing state... [id=quarkus_scaling-scale-cpu]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.alb_sg.aws_security_group.this has changed
  ~ resource "aws_security_group" "this" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-015cd01a50594aac7"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "controls access to the ALB"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "load-balancer-security-group"
        tags                   = {
            "Name" = "load-balancer-security-group-server-benchmarks-sg"
            "VPC"  = "vpc-0f148e21e9804a865"
        }
        # (6 unchanged attributes hidden)
    }

  # module.ecs_tasks_sg.aws_security_group.this has changed
  ~ resource "aws_security_group" "this" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-093e12a955bfba951"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "allow inbound access from the ALB only"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = [
                  + "sg-015cd01a50594aac7",
                ]
              + self             = false
              + to_port          = 0
            },
        ]
        name                   = "ecs-tasks-security-group"
        tags                   = {
            "Name" = "ecs-tasks-security-group-server-benchmarks-sg"
            "VPC"  = "vpc-0f148e21e9804a865"
        }
        # (6 unchanged attributes hidden)
    }

  # module.private_database_sg.aws_security_group.this has changed
  ~ resource "aws_security_group" "this" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0686e0540aff25654"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "allow inbound access only from resources in VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "2a05:d018:1532:d100::/56",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        name                   = "private_database_sg"
        tags                   = {
            "Name" = "private_database_sg-server-benchmarks-sg"
            "VPC"  = "vpc-0f148e21e9804a865"
        }
        # (6 unchanged attributes hidden)
    }

  # module.public_alb.aws_alb_listener.http_tcp[0] has changed
  ~ resource "aws_alb_listener" "http_tcp" {
        id                = "arn:aws:elasticloadbalancing:eu-west-1:143441946271:listener/app/main-ecs-lb/130ad4e7ef9ade49/984ad64207d015ff"
      + tags              = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.books-database-quarkus.module.aurora_postgresql_v2.aws_rds_cluster.this[0] has changed
  ~ resource "aws_rds_cluster" "this" {
      ~ cluster_members                     = [
          + "booksdb-quarkus-one",
        ]
        id                                  = "booksdb-quarkus"
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.books-database-quarkus.module.aurora_postgresql_v2.aws_rds_cluster_instance.this["one"] has changed
  ~ resource "aws_rds_cluster_instance" "this" {
        id                                    = "booksdb-quarkus-one"
      + tags                                  = {}
        # (30 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.books-database-springboot.module.aurora_postgresql_v2.aws_rds_cluster.this[0] has changed
  ~ resource "aws_rds_cluster" "this" {
      ~ cluster_members                     = [
          + "booksdb-springboot-one",
        ]
        id                                  = "booksdb-springboot"
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.books-database-springboot.module.aurora_postgresql_v2.aws_rds_cluster_instance.this["one"] has changed
  ~ resource "aws_rds_cluster_instance" "this" {
        id                                    = "booksdb-springboot-one"
      + tags                                  = {}
        # (30 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.vpc_flow_logs will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "bookstore-vpc-flow-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_flow_log.vpc_flow_logs will be created
  + resource "aws_flow_log" "vpc_flow_logs" {
      + arn                      = (known after apply)
      + iam_role_arn             = "arn:aws:iam::143441946271:role/vpc-flow-cloudwatch-logs-role"
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = (known after apply)
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-0f148e21e9804a865"
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @akoufa, Action: `pull_request`*